{
    "layout": {
        "title": "Esteban's Website",
        "home": "home",
        "projects": "projects",
        "about": "About"
    },
    "index": {
        "title": "<hello world>",
        "subtitle": "coming soon..."
    },
    "lang": {
        "title": "Choose your language"
    },
    "projects": {
        "title": "Main Page",
        "subtitle": "for all my projects"
    },
    "about": {
        "title": "About this web site",
        "introduction": "This website has been entirely written by hand in order to put into practice a set of learning. It is inevitably imperfect but is destined to evolve as and when.",
        "content": {
            "0": "You will find mainly the part 'projects' which aims to identify all of my work which I deem useful that it is shared. This allows to show what I can but also to share creations to make them known. You will also find the part 'About', on which you are currently, and 'Estéban SOUBIRAN', which is a page where I present myself, and where I explain the reasons for the creation of this site.",
            "1": "This website is powered by a server written in NodeJS and uses the different standards of the web.",
            "2": "If you encounter a problem, do not hesitate to contact me."
        }
    },
    "me": {
        "title": "Estéban SOUBIRAN",
        "introduction": "I am currently in an engineering school at INSA Center-Val de Loire. I wish, in 3rd year, to specialize in security and computer technologies, an area that I particularly like.",
        "content": {
            "0": "Since a young age, I am curious, I like to discover and understand the world around me. I ended up getting very interested in new technologies, robotics and computers. I am fortunate to have a MINDStorms 2.0 from LEGO which allowed me to learn about block programming. Subsequently, I read a lot and watched videos on the programming, the different languages that exist. I really liked seeing the result but I often did not understand much about code, but my biggest goal was to have my own website, created from start to finish by my hands. Then, at 17, I decided to start, I started to write my first lines of codes, following multiple tutorials on the web. My first languages were C, following the advice of a friend.",
            "1": "After entering my school, I was able to participate in 'La Nuit de l'Info', a 16-hour team programming event. From there, I understood that what I liked most was to use the different technologies of the web. So I learned, in self-learning, HTML, CSS / SCSS and JavaScript for 4 months, and I continue to learn. Then I observed the different back-end languages: PHP, Ruby, NodeJS, Python ... But I decided to get started in NodeJS. Very curious, I continue to learn, in permance, to enrich my skills but also and especially for pleasure.",
            "2": "So I decided to put into practice my learning, to have a goal and to realize a dream, through this web site, entirely realized by hand, thanks to this knowledge acquired through tutorials or videos online.",
            "3": "It is far from perfect, but I am still very proud. And it serves me as an experimental laboratory to try and discover new things! Enjoy!"
        }
    },
    "posts": {
        "create": {
            "title": "Create your post"
        }
    }
}