{
    "layout": {
        "title": "Site Web d'Estéban",
        "home": "acceuil",
        "projects": "projets",
        "about": "a propos",
        "create": "Créer"
    },
    "index": {
        "title": "<hello world>",
        "subtitle": "prochainement..."
    },
    "projects": {
        "title": "Page Principale",
        "subtitle": "pour tous mes projets"
    },
    "lang": {
        "title": "Choisissez votre language"
    },
    "about": {
        "title": "A propos de ce site web",
        "introduction": "Ce site web a entièrement été écrit à la main dans le but de mettre en pratique un ensemble d'apprentissages. Il est donc inévitablement imparfait mais est voué à évoluer au fur et à mesure.",
        "content": {
            "0": "Vous trouverez principalement la partie 'projets' qui a pour but de recenser l'ensemble de mes travaux dont je juge utiles qu'il soit partagé. Cela permet de montrer de quoi je suis capable mais aussi de partager des créations pour les faire connaitre. Vous trouverez aussi la partie 'A propos', sur laquelle vous êtes actuellement, et 'Estéban SOUBIRAN', qui est une page où je me présente, et où j'explique notemment les raisons de la création de ce site.",
            "1": "Ce site web est propulsé par un serveur écrit en NodeJS et utilise les différents standart du web.",
            "2": "Si vous rencontrez un problème, n'hésitez pas à me contacter."
        }
    },
    "me": {
        "title": "Estéban SOUBIRAN",
        "introduction": "Je suis actuellement dans une école d'ingénieurs, à l'INSA Centre-Val de Loire. Je souhaite, en 3ème année me spécialiser dans la sécurité et les technologies informatiques, domaine que j'apprécie particulièrement.",
        "content": {
            "0": "Depuis mon plus jeune âge, je suis curieux, j'aime découvrir et comprendre le monde qui m'entoure. J'ai fini par m'intérresser de très près aux nouvelles technologies, à la robotiques et à l'informatiques. J'ai la chance de posséder un MINDStorms 2.0 de LEGO qui m'a permis de m'initier à la programmation par blocs. Par la suite, j'ai énormément lu et regardé de vidéos sur la programmation, les différents languages qui existent. J'aimais beaucoup voir le résultat mais je ne comprenais souvent pas grand chose au code, mais mon plus grand but était d'avoir mon propre site internet, créé du début à la fin par mes mains. Puis, à 17 ans, j'ai décidé de me lancer, j'ai commencé à écrire mes premières lignes de codes, en suivant de multiples tutoriaux sur le web. Mon premières languages fût le C, à la suite des conseils d'un ami.",
            "1": "A la suite de mon entré dans mon école, j'ai pu participer à 'La Nuit de l'Info', évènement de programmation par équipe pendant 16 heures. A partir de là, j'ai compris que ce qui me plaisait le plus, c'était d'utiliser les différentes technologies du web. J'ai donc appris, en auto-apprentissage, l'HTML, le CSS/SCSS puis le JavaScript pendant 4 mois, et je continue d'apprendre. Puis j'ai observé les différents languages back-end: PHP, Ruby, NodeJS, Python... Mais j'ai décidé de me lancer dans NodeJS.  Très curieux, je continue d'apprendre, en permance, pour enrichir mes compétences mais aussi et surtout par plaisir.",
            "2": "J'ai donc décidé de mettre en pratique mes apprentissages, avoir un objectif et réaliser un rêve, au travers de ce site web, entièrement réalisé à la main, grâce à ces connaissances aquises par le biais de tutoriaux ou de de vidéos en ligne.",
            "3": "Il est loin d'être parfait, mais j'en suis tout de même très fier. Et il me sert de laboratoire d'expérimentation pour essayer et découvrir de nouvelles choses ! Enjoy !"
        }
    },
    "posts": {
        "create": {
            "title": "Créer son post"
        }
    }
}